In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({'Date':['10/2/2011', '11/2/2011', '12/2/2011', '13/2/11'],
                    'Event':['Music', 'Poetry', 'Theatre', 'Comedy'],
                    'Cost':[10000, 5000, 15000, 2000]})
df

        Date    Event   Cost
0  10/2/2011    Music  10000
1  11/2/2011   Poetry   5000
2  12/2/2011  Theatre  15000
3    13/2/11   Comedy   2000

In [9]:
lol=[]
for i in range(df.shape[0]):
    lol.append(list(df.iloc[i,:]))
    
print(lol)

[['10/2/2011', 'Music', 10000], ['11/2/2011', 'Poetry', 5000], ['12/2/2011', 'Theatre', 15000], ['13/2/11', 'Comedy', 2000]]

In [11]:
lol_=[]
for index,rows in df.iterrows():
    my=[rows.Date,rows.Event,rows.Cost]
    lol_.append(my)

In [12]:
lol_

[['10/2/2011', 'Music', 10000],
 ['11/2/2011', 'Poetry', 5000],
 ['12/2/2011', 'Theatre', 15000],
 ['13/2/11', 'Comedy', 2000]]

In [18]:
df.head(df['Cost'].max())

        Date    Event   Cost
0  10/2/2011    Music  10000
1  11/2/2011   Poetry   5000
2  12/2/2011  Theatre  15000
3    13/2/11   Comedy   2000

# Select rows with max value of a column

In [19]:
df.max()

Date     13/2/11
Event    Theatre
Cost       15000
dtype: object

In [28]:
print(df[df.Cost == df.Cost.max()])

        Date    Event   Cost
2  12/2/2011  Theatre  15000

In [29]:
data = {'Name':["Akash", "Geeku", "Pankaj", "Sumitra","Ramlal"],
       'Branch':["B.Tech", "MBA", "BCA", "B.Tech", "BCA"],
       'Score':["80","90","60", "30", "50"],
       'Result': ["Pass","Pass","Pass","Fail","Fail"]}
 
# creating a dataframe
df1 = pd.DataFrame(data)
  
df1

      Name  Branch Score Result
0    Akash  B.Tech    80   Pass
1    Geeku     MBA    90   Pass
2   Pankaj     BCA    60   Pass
3  Sumitra  B.Tech    30   Fail
4   Ramlal     BCA    50   Fail

In [34]:
df1.dtypes

Name      object
Branch    object
Score     object
Result    object
dtype: object

In [42]:
df1.Score=df1.Score.astype("int64")

In [43]:
df1.dtypes

Name      object
Branch    object
Score      int64
Result    object
dtype: object

In [54]:
##Convert rows into columns

In [48]:
Result=df1.pivot_table("Score",["Name","Branch"],"Result")

In [49]:
df1

      Name  Branch  Score Result
0    Akash  B.Tech     80   Pass
1    Geeku     MBA     90   Pass
2   Pankaj     BCA     60   Pass
3  Sumitra  B.Tech     30   Fail
4   Ramlal     BCA     50   Fail

In [50]:
Result

Result          Fail  Pass
Name    Branch
Akash   B.Tech   NaN  80.0
Geeku   MBA      NaN  90.0
Pankaj  BCA      NaN  60.0
Ramlal  BCA     50.0   NaN
Sumitra B.Tech  30.0   NaN

# Select random rows

In [60]:
df.sample(n=3)

        Date   Event   Cost
1  11/2/2011  Poetry   5000
3    13/2/11  Comedy   2000
0  10/2/2011   Music  10000

In [63]:
df.rename(columns={"Event":"lol"} , inplace=True)

In [64]:
df

        Date      lol   Cost
0  10/2/2011    Music  10000
1  11/2/2011   Poetry   5000
2  12/2/2011  Theatre  15000
3    13/2/11   Comedy   2000